<?php
/****************
 * 
 * 	Index 語系檔
 * 
 */
return [
	// 前端
	"bet_area" => [
		'hi' => '嗨!',
		'maxwin' => '最高可贏',
		'better_rate' => '自動接受更好賠率',
		'bet' => '投注',
		'cancel' => '取消',
		'limit' => '限額',
	],
	'mainArea' => [
		'early' => '早盤',
		'living' => '滾球',
		'today' => '今日',
		'time' => '比賽時間: ',
		'homeWin' => '主勝',
		'awayWin' => '客勝',
		'tie' => '平局',
		'cancel' => '取消',
		'nogame' => '目前沒有賽事',
		'nogameitem' => '目前沒有投注玩法',
		'nomredata' => '沒有更多資料了',
		'homeTeam' => '主隊',
		'awayTeam' => '客隊',
		'gaming' => '開賽中',
		'notgaming' => '未開賽',
		'homeTeamTag' => '主'
	],
	'm_order' => [
		'morder_detail' => '串關明細',
		'clear_all_order' => '清除注單',
		'max_ten' => '一次最多串10注!',
		'at_least_two' => '串關至少兩注!',
	],
	'js' => [
		'websocket_connect_err' => 'WebSocket連接錯誤:',
		'big' => '大',
		'small' => '小',
		'limit' => '限額',
		'no_bet_amout' => '請先下注!',
		'tooless_bet_amout' => '最低投注',
		'toohigh_bet_amout' => '最高投注',
	],
	'priorityArr' => [
		1 => ['5', '6', '14', '18', '22', '26', '28'],  // 獨贏系列
		2 => ['1', '3', '12', '16', '20', '24', '27'],  // 大小系列
		3 => ['2', '4', '9', '10', '11', '15', '19', '23', '29']  // 讓球系列
	],
	'game_priority' => [
		1 => "全場大小",   // 通用
        2 => "全場讓球",   // 通用
        3 => "上半場大小",   // 通用
        4 => "上半場讓球",   // 通用
        5 => "全場獨贏",   // 通用
        6 => "上半場獨贏",   // 通用
        7 => "全場波膽",   // 足
        8 => "上半場-波膽",   // 足
        9 => "全場讓分",   // 籃
        10 => "上半場讓分",   // 籃
        11 => "第1節讓分",   // 籃
        12 => "第1節大小",   // 籃
        13 => "第1節單/雙",   // 籃
        14 => "第1節獨贏",   // 籃
        15 => "第2節讓分",   // 籃
        16 => "第2節大小",   // 籃
        17 => "第2節單/雙",   // 籃
        18 => "第2節獨贏",   // 籃
        19 => "第3節讓分",   // 籃
        20 => "第3節大小",   // 籃
        21 => "第3節單/雙",   // 籃
        22 => "第3節獨贏",   // 籃
        23 => "第4節讓分",   // 籃
        24 => "第4節大小",   // 籃
        25 => "第4節單/雙",   // 籃
        26 => "第4節獨贏",   // 籃
        27 => "前5局 - 大小",   // 棒
        28 => "前5局 - 勝平負",   // 棒
        29 => "前5局 - 讓球",   // 棒
	],
	'sportBetData' => [
		6046 => [
			'gameTitle' => ['全場獨贏', '全場讓球', '全場大小', '上半場獨贏', '上半場讓球', '上半場大小'],
			'priorityArr' => [13, 15, 17, 14, 16, 18],
			'stage' => ['上半場', '下半場', '延長賽'],
			'ws' => 'wss://soccer.asgame.net/ws'
		],
		48242 => [
			'gameTitle' => ['全場獨贏', '全場讓分', '全場大小', '上半場獨贏', '上半場讓分', '上半場大小'],
			'priorityArr' => [7, 9, 11, 8, 10, 12],
			'stage' => ['第一節', '第二節', '第三節', '第四節', '延長賽'],
			'ws' => 'wss://basketball.asgame.net/ws'
		],
		154914 => [
			'gameTitle' => ['全場獨贏', '全場讓球', '全場大小', '前五局獨贏', '前五局讓球', '前五局大小'],
			'priorityArr' => [1, 3, 5, 2, 4, 6],
			'stage' => ['第一局', '第二局', '第三局', '第四局', '第五局', '第六局', '第七局', '第八局', '第九局', '延長賽'],
			'ws' => 'wss://baseball.asgame.net/ws'
		],
		4 => [
			'gameTitle' => ['全場獨贏', '全場讓球', '全場大小', '半場獨贏', '半場讓球', '半場大小', '所有', '獨贏', '讓球', '大小'],
			'priorityArr' => ['5', '2', '1', '6', '4', '3']
		],
		5 => [
			'gameTitle' => ['全場獨贏', '全場讓球', '全場大小', '半場獨贏', '半場讓球', '半場大小', '所有', '獨贏', '讓球', '大小'],
			'priorityArr' => ['5', '2', '1', '6', '4', '3']
		],
		6 => [
			'gameTitle' => ['全場獨贏', '全場讓球', '全場大小', '半場獨贏', '半場讓球', '半場大小', '所有', '獨贏', '讓球', '大小'],
			'priorityArr' => ['5', '2', '1', '6', '4', '3']
		],
		7 => [
			'gameTitle' => ['全場獨贏', '全場讓球', '全場大小', '半場獨贏', '半場讓球', '半場大小', '所有', '獨贏', '讓球', '大小'],
			'priorityArr' => ['5', '2', '1', '6', '4', '3']
		],
		8 => [
			'gameTitle' => ['全場獨贏', '全場讓球', '全場大小', '半場獨贏', '半場讓球', '半場大小', '所有', '獨贏', '讓球', '大小'],
			'priorityArr' => ['5', '2', '1', '6', '4', '3']
		],
		9 => [
			'gameTitle' => ['全場獨贏', '全場讓球', '全場大小', '半場獨贏', '半場讓球', '半場大小', '所有', '獨贏', '讓球', '大小'],
			'priorityArr' => ['5', '2', '1', '6', '4', '3']
		]
	],

	'tableLivingData' => [
		"fulltimescore" => "總分",
		"firsthalfscore" => "上半場比分",
		"secondhalfscore" => "下半場比分",
		"firsthalfscore" => "上半場比分",
		"secondhalfscore" => "下半場比分",
		"firstquarter" => "第一節比分",
		"secondquarter" => "第二節比分",
		"thirdquarter" => "第三節比分",
		"fourthquarter" => "第四節比分",
		"firstround" => "1局",
		"secondgame" => "2局", 
		"thirdinning" => "3局", 
		"fourthinning" => "4局", 
		"fifthinning" => "5局", 
		"sixthinning" => "6局", 
		"seventhinning" => "7局", 
		"eighthinning" => "8局", 
		"ninthinning" => "9局", 
		"tenthinning" => "10局", 
		"eleventhinning" => "11局", 
		"twelfthinning" => "12局", 
	],
	
];