<?php
/****************
 * 
 * 	Order 語系檔
 * 
 */
return [
	// 前端
	"main" => [
		"index" => "編號",
		"sport_type" => "體育種類",
		"order_type" => "注單種類",
		"bet_type" => "玩法",
		"detail" => "賽事投注詳情",
		"bet_money" => "投注金額",
		"return_money" => "派獎金額",
		"status" => "狀態",
		"m_bet" => "串關投注",
		"sport_bet" => "體育投注",
		"open" => "展開",
		"close" => "收起",
		"nodata" => "暫無資料",
		"total" => "總計",
		"first_page" => "第一頁",
		"pre_page" => "上一頁",
		"next_page" => "下一頁",
		"last_page" => "最後一頁",
	],
	'sportPriority' => [
		1 => '全場獨贏',
		2 => '前五局獨贏',
		3 => '全場讓球',
		4 => '前五局讓球',
		5 => '全場大小',
		6 => '前五局大小',
		7 => '全場獨贏',
		8 => '上半場獨贏',
		9 => '全場讓分',
		10 => '上半場讓分',
		11 => '全場大小',
		12 => '上半場大小',
		13 => '全場獨贏',
		14 => '上半場獨贏',
		15 => '全場讓球',
		16 => '上半場讓球',
		17 => '全場大小',
		18 => '上半場大小',
	]
	// 後端
];