// tw.js (繁體中文翻譯文本)
const twTranslation = {
  IndexNavbar: {
    home: "首頁",
    hot: "熱門",
    streamimg: "直播",
  },
  IndexMatchList: {
    today: "今日",
    living: "滾球",
    early: "早盤",
    champion: "冠軍",
  },
  IndexMatchMenuPanel: {
    availlableCount: "可投注項 : ",
  },
  CommonFooter: {
    focus: "關注",
    record: "注單",
    home: "首頁",
    morder: "串關",
    sport: "體育",
  },
  CommonHistory: {
    record: "投注紀錄",
    notcheckout: "未結算",
    checkout: "已結算",
    sport: "體育投注注單ID:",
    morder: "串關投注注單ID:",
    betamount: "投注金額:",
    winamount: "派彩金額:",
    betstatus: "注單狀態:",
    bettime: "下注時間:",
    nomoredata: "沒有更多注單了",
  },
  CommonHistorySlideToggle: {
    open: "展開",
    close: "收起",
  },
  CommonLogs: {
    record: "帳變紀錄",
    logs_id: "交易編號",
    logs_type: "交類類型",
    logs_amount: "交易金額",
    logs_before_amount: "交易前餘額",
    logs_after_amount: "交易後餘額",
    logs_time: "操作時間",
    nomoredata: "沒有更多紀錄了",
  },
  CommonNotice: {
    notice: "公告",
    system: "系统公告",
    soccer: "足球",
    basketball: "籃球",
    baseball: "棒球",
    iceball: "冰球",
    tennis: "網球",
    football: "美式足球",
    snooker: "斯諾克",
    tabletennis: "乒乓球",
    volleyball: "排球",
    norecord: "沒有相關公告",
  },
  CommonCalculator: {
    noinputmoney: "請先下注",
    tooless: "小於投注限額",
    toohigh: "大於投注限額",
    atleasttwo: "串關至少要兩注",
    betterrate: "自動接受更好的賠率",
    clearall: "清除全部",
    maxwinning: "最高可贏",
    cancel: "取消",
    submit: "投注",
    limit: "限額",
  },
  GameTopSlider: {
    collect: "收藏",
    streamimg: "直播",
    animate: "動畫",
  },
  GameMain: {
    all: "所有",
    win: "獨贏",
    hcap: "讓球",
    hcapS: "讓分",
    size: "大小",
    bd: "波膽",
    bet: "投注",
    analyze: "賽事分析",
    home: "主隊",
    away: "客隊",
    tie: "平局",
  },
  MatchContent: {
    nomorematch: "沒有更多賽事了",
    game_priority: {
      1: "全場大小", // 通用
      2: "全場讓球", // 通用
      3: "上半場大小", // 通用
      4: "上半場讓球", // 通用
      5: "全場獨贏", // 通用
      6: "上半場獨贏", // 通用
      7: "全場波膽", // 足
      8: "上半場-波膽", // 足
      9: "全場讓分", // 籃
      10: "上半場讓分", // 籃
      11: "第1節讓分", // 籃
      12: "第1節大小", // 籃
      13: "第1節單/雙", // 籃
      14: "第1節獨贏", // 籃
      15: "第2節讓分", // 籃
      16: "第2節大小", // 籃
      17: "第2節單/雙", // 籃
      18: "第2節獨贏", // 籃
      19: "第3節讓分", // 籃
      20: "第3節大小", // 籃
      21: "第3節單/雙", // 籃
      22: "第3節獨贏", // 籃
      23: "第4節讓分", // 籃
      24: "第4節大小", // 籃
      25: "第4節單/雙", // 籃
      26: "第4節獨贏", // 籃
      27: "前5局 - 大小", // 棒
      28: "前5局 - 勝平負", // 棒
      29: "前5局 - 讓球", // 棒
    },
  },
  MatchContentCard: {
    hometag: "主",
    homewin: "主勝",
    awaywin: "客勝",
    tie: "平局",
    allwin: "全場獨贏",
    allhcap: "全場讓球",
    allhcapS: "全場讓分",
    allsize: "全場大小",
    home: "主隊",
    away: "客隊",
    halfwin: "半場獨贏",
    halfhcap: "半場讓球",
    halfsize: "半場大小",
    alltie: "全場平局",
    firsthalfwin: "上半獨贏",
    firsthalfhacpS: "上半讓分",
    firsthalfsize: "上半大小",
    firstfivewin: "前五獨贏",
    firstfivehcap: "前五讓球",
    firstfivesize: "前五大小",
    all: "所有",
    win: "獨贏",
    hcap: "讓球",
    hcapS: "讓分",
    size: "大小",
    big: "大",
    small: "小",
    stage: {
      1: ["上半場", "下半場", "延長賽"],
      2: ["第一節", "第二節", "第三節", "第四節", "延長賽"],
      3: [
        "第一局",
        "第二局",
        "第三局",
        "第四局",
        "第五局",
        "第六局",
        "第七局",
        "第八局",
        "第九局",
        "延長賽",
      ],
      4: [
        "第一局",
        "第二局",
        "第三局",
        "第四局",
        "第五局",
        "第六局",
        "第七局",
        "第八局",
        "第九局",
        "延長賽",
      ],
      5: [
        "第一局",
        "第二局",
        "第三局",
        "第四局",
        "第五局",
        "第六局",
        "第七局",
        "第八局",
        "第九局",
        "延長賽",
      ],
      6: [
        "第一局",
        "第二局",
        "第三局",
        "第四局",
        "第五局",
        "第六局",
        "第七局",
        "第八局",
        "第九局",
        "延長賽",
      ],
      7: [
        "第一局",
        "第二局",
        "第三局",
        "第四局",
        "第五局",
        "第六局",
        "第七局",
        "第八局",
        "第九局",
        "延長賽",
      ],
      8: [
        "第一局",
        "第二局",
        "第三局",
        "第四局",
        "第五局",
        "第六局",
        "第七局",
        "第八局",
        "第九局",
        "延長賽",
      ],
      9: [
        "第一局",
        "第二局",
        "第三局",
        "第四局",
        "第五局",
        "第六局",
        "第七局",
        "第八局",
        "第九局",
        "延長賽",
      ],
    },
  },
  MatchMenuNav: {
    today: "今日",
    living: "滾球",
    early: "早盤",
    champion: "冠軍",
  },
  MOrderDetail: {
    detail: "串關明細",
    clearbet: "清除注單",
  },
  MOrder: {
    maxten: "一次最多串10注!",
  },
  ErrorPage: {
    inmaintenance: "維護中",
    iplocationnotallowed: "IP位置不允許訪問頁",
  },
  CommonRulesTitles: {
    gameRules: "競猜規則",
    generalrule: "一般規則",
    baseball: "棒球",
    basketball: "籃球",
    soccor: "足球",
    bettingtype: "投注類型",
    solowinners: "獨贏盤",
    gettheball: "讓球",
    letsroll: "滾球讓球",
    totalscore: "總得分: 大 / 小",
    rollingtotalscore: "滾球總得分: 大 / 小",
    rollingballtotal: "滾球總分： 大 / 小",
    totalscoresd: "總得分: 單 / 雙",
    totalpoints: "總分: 單 / 雙",
    solowin: "獨贏 - 前5局",
    teamscores: "球隊得分 - 大/小盤",
    overtime: "加時賽",
    handicap: "讓球盤",
    fulltimehandicapresult: "全場讓球賽果",
    handicapfirstHalf: "讓球 - 上半場",
    othandicap: "加時賽 - 讓球",
    otletfirstHalf: "加時賽 - 讓球-上半場",
    bettingsizes: "大小盤 ",
    goallargeSmall: "進球: 大 / 小",
    goaloverUnderfirstHalf: "進球: 大 / 小 - 上半場",
    rollingballoverUnder: "滾球大小盤",
    otgoaloverUnder: "加時賽 - 進球: 大 / 小",
    otgoalsoverUnderfirstHalf: "加時賽 - 進球: 大 / 小 - 上半場",
    teamgoalsoverUnder: "球隊進球數 - 大 / 小",
    winalone: "獨贏",
    winalonefirstHalf: "獨贏 - 上半場",
    scoregoal: "滾球獨贏",
    example1:
      "範例1：在賽事比分為阿森納1-0曼聯時，會員投注滾球獨贏盤 – 阿森納贏",
    example2:
      "範例2：在賽事比分為阿森納1-0曼聯時，會員投注滾球獨贏盤 –曼聯贏：",
    otwinalone: "加時賽 - 獨贏",
    otwinAlonefirstHalf: "加時賽 - 獨贏 - 上半場",
    crts: "波膽",
    crtsfirstHalf: "波膽 - 上半場",
  },
  CommonRulesGeneralBaseball: {
    grBaseball_1: "如果主客場變更，所有注單將被取消。",
    grBaseball_2:
      "國際棒球比賽規則:如果比賽最少進行七局後有一隊領先10分，或最少進行五局後有一隊領先15分，賽事將會提早結束。如果遇此情況，所有的投注將繼續保持有效，包括獨贏盤，單/雙盤，讓分盤（讓壘盤）和大/小盤（總比分）。",
    grBaseball_3:
      "若投注讓分盤和大/小盤（總比分），比賽結果以9局後為準（如果主隊領先，結果便以9局上半結束時為準）。如果賽事在加時賽時被保留或中斷，比分將以最後一局的結果為準，除非主隊打成平局，或在加局賽的上半局結束時，客隊保持領先，比分將以比賽被保留時的結果為準。",
    grBaseball_4: "未特別註明的情況下，所有全場玩法均包含加時賽。",
    grBaseball_5: "上半場投注是按照第1局到第5局的結果為準。",
    grBaseball_6:
      "下半場投注是按照第6局到第9局的結果為準。為了便於結算，下半場將包含加時賽",
    grBaseball_7: "如遇賽事臨時更換先發投手的情況，所有注單將保持有效。",
    grBaseball_8:
      "如果賽事是在下半場中斷所有上半場的投注保持有效，除已有明確賽果的玩法外，所有下半場和全場的注單將被取消。",
    grBaseball_9:
      "如果比賽在規定時間前開賽，則實際開賽時間前的賽前盤投注全部有效，在實際開賽時間後的所有賽前盤投注均視為無效。",
    grBaseball_10:
      "棒球賽事，如遇比00賽尚未開賽，官方已給出賽事延期訊息，則該場賽事的所有注單將會全部取消，串關以“1“計算 ; 但遇賽事已在進行中，中途因雨或其他因素暫停比賽時，36小時內官方如有公告該場賽事將保留場上狀況、且會在7天內繼續進行，則該場賽事所有註單將會保留並正常結算。",
    grBaseball_11:
      "除國際棒球以外的棒球聯盟裁定規則（美國職棒，日本職棒，韓國職棒，台灣職棒，墨西哥棒球，澳洲棒球...等）：",
    grBaseball_11_1:
      "如遇賽事因比分懸殊（落差達7分或以上，且賽事已進行至5局），經由聯盟裁定勝負的場次，該場賽事所有注單（除單雙玩法外）皆視為有效注單。",
    grBaseball_11_2:
      "若因天氣因素（下雨.下雪...等）或其他突發因素，賽事未進行至9局提前結束，經由聯盟裁定最終賽果時，結算規則如下：",
    grBaseball_11_2_1:
      "＊ 賽事已進行至5局上半結束（含5局後），或五局下半進行中，為主場領先，則該場賽事的（全場獨贏盤、半場所有玩法以及已有明確賽果的玩法）將會正常結算。",
    grBaseball_11_2_2:
      "＊ 若賽事未進行至5局，經由聯盟裁定提前結束，則該場賽事的（半場獨贏盤、全場獨贏盤以及已有明確賽果的玩法）將會正常結算，其餘尚未有明確賽果的玩法（如全場讓分、全場大小、全場單雙、全場主客隊總分、半場讓分、半場大小，4-6局區間玩法、7-9局區間玩法）注單一律取消，串關以“1“計算。",
  },
  CommonRulesContentsBaseBall: {
    rcBaseball_1: "預測哪一支球隊將在比賽勝出。",
    rcBaseball_2: "結算時, 加時(局)賽將計算在內。",
    rcBaseball_3: "預測哪一支球隊在盤口指定的讓分數贏得某個時節或全場比賽。",
    rcBaseball_4: "預測賽事總比分將大於或小於在盤口指定的大/小盤分數。",
    rcBaseball_5:
      "如果賽事中斷前已有明確結果並且之後沒有任何顯著會影響賽事結果的情況，大/小盤注單才會被結算。若遇到任何其他情況，注單將一律被取消。",
    rcBaseball_6:
      "如果賽事在上半場中斷，所有注單將被取消，除非中斷前已有明確結果並且之後沒有任何顯著會影響賽事結果的情況注單才會被結算。",
    rcBaseball_7: "如果賽事在下半場取消或中斷，所有上半場注單保持有效。",
    rcBaseball_8:
      "如果賽事在下半場取消或中斷，所有下半場和全場注單將被取消，除非中斷前已有明確結果並且之後沒有任何顯著會影響賽事結果的情況注單才會被結算。",
    rcBaseball_9: "結算是以0-0的比分按盤口開出的大小盤讓分數做裁決",
    rcBaseball_10: "預測賽事的總比分是單數或雙數。",
    rcBaseball_11: "預測哪支球隊將在前5局結束時獲勝或者打平",
    rcBaseball_12: "只提供於此時間段，不適用於賽事結束時的最終比分。",
    rcBaseball_13:
      "預測指定的球隊總跑壘得分將大於或小於盤口指定的大/小盤分數。",
    rcBaseball_14: "結算包括加時賽局。",
    rcBaseball_15: "預測賽事是否超出常規9局時間（除非另有說明）。",
    rcBaseball_16:
      "出於結算的目的，任何常規的比賽延長到第10局或更多，將被視為進入“加時賽”。",
  },
  CommonRulesGeneralBasketball: {
    grBasketball_1: "籃球所有比賽的賽果認定皆以本公司所定的規則為準。",
    grBasketball_2:
      "賽節、半場的投注，如果賽節、半場因故中斷或者取消，導致賽節或半場並未完成，則除已經有明確賽果的投注正常結算，其余投注將被視為無效且取消。",
    grBasketball_3:
      "籃球所有比賽，指示的“主場“、“客場“和“中立場“信息僅供參考，如遇主客場異動，不影響比賽結果，所有註單將被視為有效。",
    grBasketball_4:
      "如比賽在法定時間提前進行，在比賽開始前的投注依然有效，在比賽開始後的所有投注均視為無效(滾球投注另作別論)。",
    grBasketball_5:
      "全場玩法、下半場玩法的所有投注都包括加時賽，除非另有說明。注：單節玩法裡的第四節投注不包括加時賽賽果。",
    grBasketball_6:
      "如果比賽開始，但在原定時間的36小時內暫停或者中止，若比賽剩餘時間小於等於5分鐘，則全場所有註單被視為有效；如果比賽剩餘時間大於5分鐘，則除中斷前已有明確賽果的投注正常結算以外，其餘所有註單視為無效。",
    grBasketball_7: "對於3x3籃球，結算將基於官方比賽規則。",
    grBasketball_8: "籃球某些特定賽事，如友誼賽、積分制賽事等，遵循以下規則：",
    grBasketball_8_1:
      "若遇到平局結束，所有註單將被視為有效，以平局結束比分進行結算。",
    grBasketball_8_2:
      "若常規時間結束後已有勝負，同場隊伍因積分制原因再加時賽事，所有註單將被視為有效，加時比分不計入到第2回合，所有註單以第2回合常規時間結束的比分進行結算。",
    grBasketball_8_3:
      "若常規時間結束後為平局，同場隊伍因積分制原因再加時賽事，所有註單將被視為有效，加時比分計入第2回合，所有註單以第2回包含加時的比分進行結算。",
  },
  CommonRulesContentsBasketball: {
    rcBasketball_1: "預測哪一支球隊將在比賽勝出。盤口提供兩支球隊為投注選項。",
    rcBasketball_2: "賽事盤口包括全場、半場或單節投注。",
    rcBasketball_3:
      "預測哪一支球隊在盤口指定的讓分球數在半場/全場/賽事單節贏得比賽。",
    rcBasketball_4: "如果賽事在下半場取消或中斷，所有上半場注單保持有效。",
    rcBasketball_5: "如果賽事在下半場取消或中斷，所有下半場注單將被視為無效。",
    rcBasketball_6:
      "預測哪一支球隊在盤口指定的讓分數裏贏得半場/全場/賽事單節的比賽。",
    rcBasketball_7: "預測賽事總比分將大於或小於在盤口指定的大/小盤分數。",
    rcBasketball_8:
      "如果賽事中斷，大/小盤將僅會結算任何將來的得分不會影響到賽果的注單。若遇到任何其它情況，注單將一律被視為無效。",
    rcBasketball_9:
      "如果賽事在上半場中斷，所有上半場注單將被取消，除非中斷前已有明確結果並且之後沒有任何顯著會影響賽事結果的情況注單才會被結算。",
    rcBasketball_10:
      "如果賽事在下半場取消或中斷，所有下半場注單將被取消，除非中斷前已有明確結果並且之後沒有任何顯著會影響賽事結果的情況注單才會被結算。",
    rcBasketball_11:
      "如果賽事中斷, 所有時節的注單將被取消除非遇到以下其中一個情況：",
    rcBasketball_11_1: "投注的時節是在比賽中斷前。",
    rcBasketball_11_2:
      "比賽中斷前已有明確結果並且之後沒有任何顯著會影響賽事結果的情況。",
    rcBasketball_12:
      "結算是以0-0的比分在比賽/時節結束後按盤口開出的讓分數做裁決。",
    rcBasketball_13:
      "預測賽事主隊/客隊的總分數將大於或小於在盤口指定的大/小盤分數。",
    rcBasketball_14:
      "如果賽事取消，所有的注單將會被認為無效，除非注單在中斷前已經結算或者在中斷前已有明確的結果並且之後沒有任何顯著會影響賽事結果的情況注單才會被結算。",
    rcBasketball_15: "所有注單的結算都是依據相關體育機構的官方統計數據為準。",
    rcBasketball_16: "預測賽事的總比分是單數或雙數。",
  },
  CommonRulesGeneralSoccor: {
    grSoccor_1:
      "除非另有注明，所有足球投注的結算皆以球賽所規定的完場時間90分鐘為準。",
    grSoccor_2:
      "完場時間90分鐘包括球員傷停補時。加時賽、淘汰賽、點球，以及賽事後如果裁判或相關管理機構更改任何賽果則不計算在內。",
    grSoccor_3:
      "除非在個別玩法規則另有注明，所有滾球投注的結算將以90分鐘的賽果為準。",
    grSoccor_4:
      "完場時間45分鐘是指賽事上半場，其中包含傷停補時。加時賽、淘汰賽、點球，以及賽事後如果裁判或相關管理機構更改任何賽果則不計算在內。",
    grSoccor_5:
      "若青少年賽、友誼賽的完場時間為70分鐘（2x35分鐘）或更少，本公司將在開賽前做出公布，否則該場賽事的注單一律作廢。",
    grSoccor_6:
      "對於某些以全場完場時間為80分鐘（2x40分鐘）的特定賽事或者友誼賽，所有投注的結算皆以完場時間為準。",
    grSoccor_7:
      "沙灘足球賽事，盤口僅限進行36分鐘(3x12)的賽事;室內五人足球賽事，盤口僅限進行40分鐘(2x20)的賽事。",
    grSoccor_8:
      "如果賽事取消，中斷或延遲並且沒有在官方指定開球時間的36小時內重新開始，該賽事投注均被視為無效且取消 ( 已經有明確賽果的投注會正常結算，或在其它體育規則裡另有指定說明除外 )",
    grSoccor_9:
      "如果賽事確認取消，所有該場賽事的投注即被視為無效且取消，除非在個別投注類型規則裏另有指定注明。如果賽事是在上半場中斷，所有上半場的注單將被取消。如果賽事是在下半場中斷所有上半場的投注保持有效，但所有下半場的注單將被取消，除非在個別玩法規則另有注明。",
    grSoccor_10: "除非在個別玩法規則另有注明，烏龍球將予以計算在內。",
    grSoccor_11: "如果比賽場地有變更（主客隊調換），所有此注單將被取消。",
    grSoccor_12:
      "對於國際賽事，只要變更的場地仍在同一個國家內，所有注單將保持有效。",
    grSoccor_13:
      "對於國際賽事，只要變更的場地仍在聯賽原定舉辦的國家內，所有注單將保持有效。",
    grSoccor_14:
      "本公司保留權利取消任何因更換場地而可能對賽事結果有影響的注單。",
    grSoccor_15:
      "若賽事的確切開賽時間不明（比如，由於電視直播時間安排的問題），要是在原本開賽時間的72小時之內，本平臺保留調整該開賽時間的權利。",
    grSoccor_16:
      "除非另有註明，對於特定的15分鐘玩法，進球時間以確定得分的時間，即足球超過球門線的時間為準，角球時間以開出角球的時間為準，罰牌時間以官方裁判掏牌的時間為準。",
  },
  CommonRulesContentsSoccor: {
    rcSoccor_1:
      "預測哪一支球隊在盤口指定的讓球數在全場/半場/賽事某個時節贏得比賽。",
    rcSoccor_2:
      "“讓球盤”則定義為在比賽正式開始前，一方球隊已得到另一方讓的虛擬分數，以領先的情況下開始比賽。",
    rcSoccor_3: "所有注單將按盤口開出的讓球數在玩法的時節結束後結算。",
    rcSoccor_4:
      "讓球隊（優勢球隊）將給出讓球，讓球數將顯示在賠率的左側，讓球隊在盤面上也會以粗型字體顯示",
    rcSoccor_5: "讓球盤的玩法分為以下幾種：",
    rcSoccor_5_1: "整數讓球也或稱為讓‘一球’（如：-1，-2，-3，等）",
    rcSoccor_5_2: "非整數讓球也或稱為‘半球’（如：-0.5，-1.5，-2.5，等）",
    rcSoccor_5_3:
      "混合以上讓‘半球/一球’的方式（如：-0/0.5，-0.5/1，-1/1.5，等）",
    rcSoccor_6: "根據盤口讓球信息預測最終獲得勝利的球隊。",
    rcSoccor_7: "投注的結算皆以球賽所規定的完場時間90分鐘為準。",
    rcSoccor_8: "如果賽事在90分鐘結束前取消或中斷，所有注單將會被視為無效。",
    rcSoccor_9: "投注一場球賽經讓球調整後的全場賽果是主勝、客勝或和局。",
    rcSoccor_10:
      "全場讓球賽果是根據法定比賽時間的全場賽果為準，不包括加時賽或點球大戰賽果。",
    rcSoccor_11:
      "較強球隊會讓球予較弱球隊，勝負由正式賽果加上讓球作調整決定， 讓球數目為整數，例如一球，兩球，三球等等。您可依照調整後的賽果，預測主隊勝、和局或客隊勝。",
    rcSoccor_12: "讓球主隊和客隊在隊名後有（-）或（+）符號。",
    rcSoccor_12_1: "例子: 雲達不萊梅 (-1)   平局 (-1)      拜仁慕尼黑 (+1)",
    rcSoccor_12_2:
      "(-) 表示讓球的球隊，而隨後的數字表示讓球數目，例如-1即讓1球",
    rcSoccor_12_3: "(-) 表示主隊讓球，而隨後的數字表示讓球數目，例如-1即讓1球",
    rcSoccor_12_4:
      "(+) 表示受讓的球隊，而隨後的數字表示受讓數目，例如+1即受讓1球",
    rcSoccor_12_5:
      "據計算讓球以後的賽果來判斷勝平負，例如上圖【雲達不萊梅】讓 1 球予【拜仁慕尼黑】， 全場賽果為 1:1，經過讓球調整後的賽果只需將【拜仁慕尼黑】隊加上一球，而【雲達不萊梅】隊贏的一球維持不變， 因此調整後賽果為1:2，故下注【拜仁慕尼黑】+1的投注為贏。",
    rcSoccor_13:
      "我的註單記錄頁面，賽事隊伍信息處比分（非投注項比分），為投注時的比賽實時比分。",
    rcSoccor_14:
      "所有上半場的投注將以上半場45分鐘其中包含傷停補時後的賽果結算。",
    rcSoccor_15:
      "如果賽事在上半場時節因任何理由取消或中斷，所有上半場注單將被取消。",
    rcSoccor_16:
      "如果賽事在下半場或加時賽因任何理由取消或中斷，所有上半場注單保持有效。",
    rcSoccor_17: "所有注單將按照盤口開出讓球信息，在相應投注類型結束後結算。",
    rcSoccor_18:
      "結算是以投注時到比賽/時節結束後的賽果做裁決。即是以賽事完場比分減去投注當時的比分。 上半場的滾球讓球投注將以上半場結束後的賽果結算。",
    rcSoccor_19:
      "所有注單將按照盤口開出讓球信息，在30分鐘加時賽結束後計算，包含補時。",
    rcSoccor_20: "如果賽事在加時賽結束前取消或中斷，所有注單將會被視為無效。",
    rcSoccor_21:
      "所有注單將按照盤口開出讓球信息，在15分鐘加時賽結束後計算，包含補時。",
    rcSoccor_22:
      "加時賽中如果賽事在上半場取消或中斷，所有上半場注單將會被視為無效。",
    rcSoccor_23:
      "加時賽中如果賽事在下半場或補時階段取消或中斷，所有上半場注單將會被視為有效。",
    rcSoccor_24: "預測賽事總入球數將大於或小於在盤口指定的大/小盤球數。",
    rcSoccor_25:
      "如果賽事的總入球數多於盤口的大/小盤球數，則為大盤。如果少於盤口的大/小盤球數，則為小盤。",
    rcSoccor_26: "所有注單將按盤口開出的大/小盤球數在玩法的時節結束後結算。",
    rcSoccor_27: "大/小盤的玩法分為以下幾種：",
    rcSoccor_27_1: "大/小於‘一球’（如：2，3，4，等）",
    rcSoccor_27_2: "大/小於‘半球’（如：1.5，2.5，3.5，等）",
    rcSoccor_27_3: "混合以上‘半球/一球’的方式（如：1.5/2，2.5/3，3.5/4，等）",
    rcSoccor_28:
      "如果賽事中斷前已有明確結果並且之後沒有任何顯著會影響賽事結果的情況，大/小盤注單才會被結算。若遇到任何其他情況，注單將一律被取消。請參考以上範例：",
    rcSoccor_28_1: "範例1：會員投注大於2.5球：",
    rcSoccor_28_1_1: "賽事在比分2-1時中斷。",
    rcSoccor_28_1_2:
      "盡管賽事中斷，但因結果已經明確並且若之後有任何潛在進球將對盤口結算裁決沒有影響，所有此會員注單結算為贏。",
    rcSoccor_28_2: "範例2：會員投注小於2.5球：",
    rcSoccor_28_2_1: "賽事在比分2-1時中斷。",
    rcSoccor_28_2_2:
      "盡管賽事中斷，但因結果已經明確並且若之後有任何潛在進球將對盤口結算裁決沒有影響，所有此會員注單結算為輸。",
    rcSoccor_28_3: "範例3：會員投注大於3.5球：",
    rcSoccor_28_3_1: "賽事在比分2-1時中斷。",
    rcSoccor_28_3_2:
      "由於賽事在未有明確的結果能裁決會員的注單前中斷，此會員的注單將被取消。",
    rcSoccor_29: "所有的投注將以全場90分鐘的賽果結算。",
    rcSoccor_30:
      "如果比賽停止，取消或中斷，所有投注將被視為無效，除非在賽事取消或中斷前，結果已經明確。",
    rcSoccor_31: "所有上半場的投注將以上半場45分鐘的賽果結算。",
    rcSoccor_32:
      "如果賽事在上半場時節因任何理由取消或中斷，所有上半場注單將被取消。除非在賽事取消或中斷前，結果已經明確。",
    rcSoccor_33:
      "如果賽事在下半場或加時時段因任何理由取消或中斷，所有上半場注單保持有效。",
    rcSoccor_34: "結算是以雙方球隊在90分鐘內的總進球數為依據。",
    rcSoccor_35:
      "兩支球隊開始加時賽的比分為0-0，之前賽果屬於常規時間內入球不會計算在內。",
    rcSoccor_36: "所有的投注將以30分鐘加時賽後結果結算，包括補時。",
    rcSoccor_37:
      "在加時賽結束前如果比賽停止，取消或中斷，所有投注將被視為無效，除非在賽事取消或中斷前，結果已經明確。",
    rcSoccor_38: "所有投注將會按照15分鐘賽事結束後賽果為準，包含補時。",
    rcSoccor_39:
      "如果比賽在上半場停止，取消或者中斷，所有上半場注單將被視為無效。",
    rcSoccor_40:
      "如果比賽在下半場或補時期間停止，取消或者中斷，所有上半場注單將被視為有效。",
    rcSoccor_41:
      "預測在特定的比賽有關期間內，其中一支球隊的總入球數將大於或小於在盤口指定的大/小盤球數。",
    rcSoccor_42:
      "如果賽事的總入球數多於盤口的大/小盤球數，則為大盤。如果少於盤口的大/小盤球數，則為小盤。",
    rcSoccor_43:
      "如果賽事中斷前已有明確結果並且之後沒有任何顯著會影響賽事結果的情況，注單才會被結算。若遇到任何其他情況，注單將一律被取消。",
    rcSoccor_44: "點球大戰與烏龍球將不予計算。",
    rcSoccor_45:
      "預測哪一支球隊將在比賽勝出。盤口提供兩支球隊和平局為投注選項。",
    rcSoccor_46: "投注將以0-0的比分作為計算基礎（讓球並不計算在內）。",
    rcSoccor_47: "預測哪一支球隊將在90分鐘比賽勝出或賽事和局。",
    rcSoccor_48: "所有上半場的投注將以上半場45分鐘賽果結算。",
    rcSoccor_49: "預測滾球時，哪一支球隊勝出。",
    rcSoccor_50: "投注的結算將以90分鐘完場賽果為準。",
    rcSoccor_51: "以下為滾球獨贏盤範例。",
    rcSoccor_52_1: "阿森納（主） vs 曼聯 ",
    rcSoccor_52_2: "目前得分 1-0",
    rcSoccor_52_3: "赔率：阿森纳 1.61 平局 3.8 曼联 6.0",
    rcSoccor_53_1: "完場賽果為阿森納2-1曼聯。",
    rcSoccor_53_2: "因阿森納在完場時勝出，所有投注阿森納的注單結算為贏。",
    rcSoccor_53_3: "所有在比分1-0時投注曼聯或平局的注單將結算為輸。",
    rcSoccor_54_1: "完場賽果為阿森納1-1曼聯。",
    rcSoccor_54_2: "因完場賽果為平局，所有投注曼聯以及阿森納的注單將結算為輸。",
    rcSoccor_54_3: "所有投注平局的注單將結算為贏。",
    rcSoccor_55:
      "加時賽則視為一場新的賽事並且會開出加時賽盤口。投注將按加時賽時節的結果做結算。",
    rcSoccor_56: "預測哪一支球隊將會在30分鐘內勝出，或賽事平局，包含補時。",
    rcSoccor_57:
      "如果比賽在加時賽結束前暫停，取消或中止，所有投注將被視為無效。",
    rcSoccor_58: "預測哪一支球隊將會在15分鐘內勝出，或賽事平局，包含補時。",
    rcSoccor_59: "如果賽事在加時賽上半場取消或中斷，所有上半場注單將會被取消。",
    rcSoccor_60:
      "如果賽事在加時賽下半場取消或中斷，所有上半場注單將被會視為有效。",
    rcSoccor_61: "預測一場特定賽事的全場準確比分。",
    rcSoccor_62: "全場波膽投注的結算根據90分鐘完場比分做出裁決。",
    rcSoccor_63:
      "如果賽事取消，已有明確賽果或全場波膽投注在“其它比分”為僅有可能獲勝的選項，投注將被視為有效；其餘的投注則被視為無效，此是由於賽事無條件決定後面的進球不會影響賽事的結果。",
    rcSoccor_64: "預測一場特定賽事半場的準確比分。",
    rcSoccor_65:
      "半場波膽投注是指投注上半場的比賽，投注的結算根據半場“45分鐘”結束後的比分做出裁決。",
    rcSoccor_66:
      "如果賽事在上半場取消，已有明確賽果或所有半場波膽投注在“其它比分”為僅有可能獲勝的選項，投注將被視為有效；其餘的投注則被視為無效，此是由於賽事無條件決定後面的進球不會影響賽事的結果。",
    rcSoccor_67: "如果賽事在下半場取消，所有半場波膽的投注被視為有效。",
  },
  ResultTitle: {
    baseball: "棒球",
    basketball: "籃球",
    soccor: "足球",
    result: "賽事結果",
    hometag: "主",
    // fullTimeScore:"全場比分",
    // firstHalfScore: "上半場比分",
    // secondHalfScore:"下半場比分",
    // firstQuarterScore:"第一節比分",
    // secondQuarterScore:"第二節比分",
    // thirdQuarterScore: "第三節比分",
    // fourthQuarterScore: "第四節比分",
    fullTimeScore:"全場",
    firstHalfScore: "上半場",
    secondHalfScore:"下半場",
    firstQuarterScore:"第一節",
    secondQuarterScore:"第二節",
    thirdQuarterScore: "第三節",
    fourthQuarterScore: "第四節",
    twoPoints: "兩分",
    threePoints:"三分",
    freeThrow:"罰球",
    freeThrowPercentage:"罰球命中率",
    numberOfThrows:"罰球次數",
    totalOfFouls:"總犯規次數",
    numFoulsCommittedFirstQuarter: "第一節犯規次數",
    numFoulsCommittedScndQuarter: "第二節犯規次數",
    numFoulsCommittedThrdQuarter:"第三節犯規次數",
    numFoulsCommittedFrthQuarter:"第四節犯規次數",
    numFoulsOT:"加時賽犯規次數",
    numFoulsCommittedFirstHalf:"上半場犯規次數",
    numFoulsCommittedScndHalf:"下半場犯規次數",
    totalPauses:"總暫停次數",
    numOfTimeoutsFirstQuarter: "第一節暫停次數",
    numOfTimeoutsScndQuarter:"第二節暫停次數",
    numOfTimeoutsThrdQuarter:"第三節暫停次數",
    numOfTimeoutsFrthQuarter:"第四節暫停次數",
    numOfTimeoutsOT:"加時賽暫停次數",
    firstRound:"第一局",
    gameTwo:"第二局",
    gameThree:"第三局",
    gameFour:"第四局",
    gameFive:"第五局",
    gameSix:"第六局",
    gameSeven:"第七局",
    gameEight:"第八局",
    gameNine:"第九局",
    gameTen:"第十局",
    gameEleven:"第十一局",
    gameTwelve:"第十二局",
    overtime: "加時",
    bttngAve:"安打比分",
  },
  scoreBoardTitle: {
    hometag: "主",
    // fulltimescore: "總分",
    fullTimeScore:"全場",
		firsthalfscore: "上半場比分",
		secondhalfscore: "下半場比分",
		firsthalfscore: "上半場比分",
		secondhalfscore: "下半場比分",
    q1: "Q1",
    q2: "Q2",
    q3: "Q3",
    q4: "Q4",
    firstRound:"第一局",
    gameOne: "1局",
    gameTwo:"第二局",
    gameThree:"第三局",
    gameFour:"第四局",
    gameFive:"第五局",
    gameSix:"第六局",
    gameSeven:"第七局",
    gameEight:"第八局",
    gameNine:"第九局",
    gameTen:"第十局",
    gameEleven:"第十一局",
    gameTwelve:"第十二局",
  }
};

export default twTranslation;
